4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_pcd.c
  * @author  MCD Application Team
  * @brief   PCD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
					##### How to use this driver #####
  ==============================================================================
	[..]
	  The PCD HAL driver can be used as follows:

	 (#) Declare a PCD_HandleTypeDef handle structure, for example:
		 PCD_HandleTypeDef  hpcd;

	 (#) Fill parameters of Init structure in HCD handle

	 (#) Call HAL_PCD_Init() API to initialize the PCD peripheral (Core, Device core, ...)

	 (#) Initialize the PCD low level resources through the HAL_PCD_MspInit() API:
		 (##) Enable the PCD/USB Low Level interface clock using
			  (+++) __HAL_RCC_USB_OTG_FS_CLK_ENABLE();
			  (+++) __HAL_RCC_USB_OTG_HS_CLK_ENABLE(); (For High Speed Mode)

		 (##) Initialize the related GPIO clocks
		 (##) Configure PCD pin-out
		 (##) Configure PCD NVIC interrupt

	 (#)Associate the Upper USB device stack to the HAL PCD Driver:
		 (##) hpcd.pData = pdev;

	 (#)Enable PCD transmission and reception:
		 (##) HAL_PCD_Start();

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal.h"

/** @addtogroup STM32H7xx_HAL_Driver
 * @{
 */

/** @defgroup PCD PCD
 * @brief PCD HAL module driver
 * @{
 */

#ifdef HAL_PCD_MODULE_ENABLED

	#if defined(USB_OTG_FS) || defined(USB_OTG_HS)

		/* Private types -------------------------------------------------------------*/
		/* Private variables ---------------------------------------------------------*/
		/* Private constants ---------------------------------------------------------*/
		/* Private macros ------------------------------------------------------------*/
		/** @defgroup PCD_Private_Macros PCD Private Macros
		 * @{
		 */
		#define PCD_MIN(a, b) (((a) < (b)) ? (a) : (b))
		#define PCD_MAX(a, b) (((a) > (b)) ? (a) : (b))
		/**
		 * @}
		 */

		/* Private functions prototypes ----------------------------------------------*/
		/** @defgroup PCD_Private_Functions PCD Private Functions
		 * @{
		 */
		#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
static HAL_StatusTypeDef PCD_WriteEmptyTxFifo(PCD_HandleTypeDef *hpcd, uint32_t epnum);
static HAL_StatusTypeDef PCD_EP_OutXfrComplete_int(PCD_HandleTypeDef *hpcd, uint32_t epnum);
static HAL_StatusTypeDef PCD_EP_OutSetupPacket_int(PCD_HandleTypeDef *hpcd, uint32_t epnum);
		#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */
/**
 * @}
 */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PCD_Exported_Functions PCD Exported Functions
 * @{
 */

/** @defgroup PCD_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
			##### Initialization and de-initialization functions #####
 ===============================================================================
	[..]  This section provides functions allowing to:

@endverbatim
  * @{
  */

/**
 * @brief  Initializes the PCD according to the specified
 *         parameters in the PCD_InitTypeDef and initialize the associated handle.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_Init(PCD_HandleTypeDef *hpcd)
{
	USB_OTG_GlobalTypeDef *USBx;
	uint8_t i;

	/* Check the PCD handle allocation */
	if (hpcd == NULL) {
		return HAL_ERROR;
	}

	/* Check the parameters */
	assert_param(IS_PCD_ALL_INSTANCE(hpcd->Instance));

	USBx = hpcd->Instance;

	if (hpcd->State == HAL_PCD_STATE_RESET) {
		/* Allocate lock resource and initialize it */
		hpcd->Lock = HAL_UNLOCKED;

		#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
		hpcd->SOFCallback = HAL_PCD_SOFCallback;
		hpcd->SetupStageCallback = HAL_PCD_SetupStageCallback;
		hpcd->ResetCallback = HAL_PCD_ResetCallback;
		hpcd->SuspendCallback = HAL_PCD_SuspendCallback;
		hpcd->ResumeCallback = HAL_PCD_ResumeCallback;
		hpcd->ConnectCallback = HAL_PCD_ConnectCallback;
		hpcd->DisconnectCallback = HAL_PCD_DisconnectCallback;
		hpcd->DataOutStageCallback = HAL_PCD_DataOutStageCallback;
		hpcd->DataInStageCallback = HAL_PCD_DataInStageCallback;
		hpcd->ISOOUTIncompleteCallback = HAL_PCD_ISOOUTIncompleteCallback;
		hpcd->ISOINIncompleteCallback = HAL_PCD_ISOINIncompleteCallback;
		hpcd->LPMCallback = HAL_PCDEx_LPM_Callback;
		hpcd->BCDCallback = HAL_PCDEx_BCD_Callback;

		if (hpcd->MspInitCallback == NULL) {
			hpcd->MspInitCallback = HAL_PCD_MspInit;
		}

		/* Init the low level hardware */
		hpcd->MspInitCallback(hpcd);
		#else
		/* Init the low level hardware : GPIO, CLOCK, NVIC... */
		HAL_PCD_MspInit(hpcd);
		#endif /* (USE_HAL_PCD_REGISTER_CALLBACKS) */
	}

	hpcd->State = HAL_PCD_STATE_BUSY;

	/* Disable DMA mode for FS instance */
	if ((USBx->CID & (0x1U << 8)) == 0U) {
		hpcd->Init.dma_enable = 0U;
	}

	/* Disable the Interrupts */
	__HAL_PCD_DISABLE(hpcd);

	/*Init the Core (common init.) */
	if (USB_CoreInit(hpcd->Instance, hpcd->Init) != HAL_OK) {
		hpcd->State = HAL_PCD_STATE_ERROR;
		return HAL_ERROR;
	}

