4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
	/* Force Device Mode*/
	(void)USB_SetCurrentMode(hpcd->Instance, USB_DEVICE_MODE);

	/* Init endpoints structures */
	for (i = 0U; i < hpcd->Init.dev_endpoints; i++) {
		/* Init ep structure */
		hpcd->IN_ep[i].is_in = 1U;
		hpcd->IN_ep[i].num = i;
		hpcd->IN_ep[i].tx_fifo_num = i;
		/* Control until ep is activated */
		hpcd->IN_ep[i].type = EP_TYPE_CTRL;
		hpcd->IN_ep[i].maxpacket = 0U;
		hpcd->IN_ep[i].xfer_buff = 0U;
		hpcd->IN_ep[i].xfer_len = 0U;
	}

	for (i = 0U; i < hpcd->Init.dev_endpoints; i++) {
		hpcd->OUT_ep[i].is_in = 0U;
		hpcd->OUT_ep[i].num = i;
		/* Control until ep is activated */
		hpcd->OUT_ep[i].type = EP_TYPE_CTRL;
		hpcd->OUT_ep[i].maxpacket = 0U;
		hpcd->OUT_ep[i].xfer_buff = 0U;
		hpcd->OUT_ep[i].xfer_len = 0U;
	}

	/* Init Device */
	if (USB_DevInit(hpcd->Instance, hpcd->Init) != HAL_OK) {
		hpcd->State = HAL_PCD_STATE_ERROR;
		return HAL_ERROR;
	}

	hpcd->USB_Address = 0U;
	hpcd->State = HAL_PCD_STATE_READY;

	/* Activate LPM */
	if (hpcd->Init.lpm_enable == 1U) {
		(void)HAL_PCDEx_ActivateLPM(hpcd);
	}

	(void)USB_DevDisconnect(hpcd->Instance);

	return HAL_OK;
}

/**
 * @brief  DeInitializes the PCD peripheral.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DeInit(PCD_HandleTypeDef *hpcd)
{
	/* Check the PCD handle allocation */
	if (hpcd == NULL) {
		return HAL_ERROR;
	}

	hpcd->State = HAL_PCD_STATE_BUSY;

	/* Stop Device */
	if (USB_StopDevice(hpcd->Instance) != HAL_OK) {
		return HAL_ERROR;
	}

		#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
	if (hpcd->MspDeInitCallback == NULL) {
		hpcd->MspDeInitCallback = HAL_PCD_MspDeInit; /* Legacy weak MspDeInit  */
	}

	/* DeInit the low level hardware */
	hpcd->MspDeInitCallback(hpcd);
		#else
	/* DeInit the low level hardware: CLOCK, NVIC.*/
	HAL_PCD_MspDeInit(hpcd);
		#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

	hpcd->State = HAL_PCD_STATE_RESET;

	return HAL_OK;
}

/**
 * @brief  Initializes the PCD MSP.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_MspInit could be implemented in the user file
	 */
}

/**
 * @brief  DeInitializes PCD MSP.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_MspDeInit could be implemented in the user file
	 */
}

		#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
/**
 * @brief  Register a User USB PCD Callback
 *         To be used instead of the weak predefined callback
 * @param  hpcd USB PCD handle
 * @param  CallbackID ID of the callback to be registered
 *         This parameter can be one of the following values:
 *          @arg @ref HAL_PCD_SOF_CB_ID USB PCD SOF callback ID
 *          @arg @ref HAL_PCD_SETUPSTAGE_CB_ID USB PCD Setup callback ID
 *          @arg @ref HAL_PCD_RESET_CB_ID USB PCD Reset callback ID
 *          @arg @ref HAL_PCD_SUSPEND_CB_ID USB PCD Suspend callback ID
 *          @arg @ref HAL_PCD_RESUME_CB_ID USB PCD Resume callback ID
 *          @arg @ref HAL_PCD_CONNECT_CB_ID USB PCD Connect callback ID
 *          @arg @ref HAL_PCD_DISCONNECT_CB_ID OTG PCD Disconnect callback ID
 *          @arg @ref HAL_PCD_MSPINIT_CB_ID MspDeInit callback ID
 *          @arg @ref HAL_PCD_MSPDEINIT_CB_ID MspDeInit callback ID
 * @param  pCallback pointer to the Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef
HAL_PCD_RegisterCallback(PCD_HandleTypeDef *hpcd, HAL_PCD_CallbackIDTypeDef CallbackID, pPCD_CallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;
		return HAL_ERROR;
	}
	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		switch (CallbackID) {
			case HAL_PCD_SOF_CB_ID:
				hpcd->SOFCallback = pCallback;
				break;

			case HAL_PCD_SETUPSTAGE_CB_ID:
				hpcd->SetupStageCallback = pCallback;
				break;

			case HAL_PCD_RESET_CB_ID:
				hpcd->ResetCallback = pCallback;
				break;

			case HAL_PCD_SUSPEND_CB_ID:
				hpcd->SuspendCallback = pCallback;
				break;

			case HAL_PCD_RESUME_CB_ID:
				hpcd->ResumeCallback = pCallback;
				break;

			case HAL_PCD_CONNECT_CB_ID:
				hpcd->ConnectCallback = pCallback;
				break;

			case HAL_PCD_DISCONNECT_CB_ID:
				hpcd->DisconnectCallback = pCallback;
				break;

			case HAL_PCD_MSPINIT_CB_ID:
				hpcd->MspInitCallback = pCallback;
				break;

			case HAL_PCD_MSPDEINIT_CB_ID:
				hpcd->MspDeInitCallback = pCallback;
				break;

			default:
				/* Update the error code */
				hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;
				/* Return error status */
				status = HAL_ERROR;
				break;
		}
	} else if (hpcd->State == HAL_PCD_STATE_RESET) {
		switch (CallbackID) {
			case HAL_PCD_MSPINIT_CB_ID:
				hpcd->MspInitCallback = pCallback;
				break;

			case HAL_PCD_MSPDEINIT_CB_ID:
				hpcd->MspDeInitCallback = pCallback;
				break;

			default:
				/* Update the error code */
				hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;
				/* Return error status */
				status = HAL_ERROR;
				break;
		}
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;
		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);
	return status;
}

/**
 * @brief  Unregister an USB PCD Callback
 *         USB PCD callabck is redirected to the weak predefined callback
 * @param  hpcd USB PCD handle
 * @param  CallbackID ID of the callback to be unregistered
 *         This parameter can be one of the following values:
 *          @arg @ref HAL_PCD_SOF_CB_ID USB PCD SOF callback ID
 *          @arg @ref HAL_PCD_SETUPSTAGE_CB_ID USB PCD Setup callback ID
 *          @arg @ref HAL_PCD_RESET_CB_ID USB PCD Reset callback ID
 *          @arg @ref HAL_PCD_SUSPEND_CB_ID USB PCD Suspend callback ID
 *          @arg @ref HAL_PCD_RESUME_CB_ID USB PCD Resume callback ID
 *          @arg @ref HAL_PCD_CONNECT_CB_ID USB PCD Connect callback ID
 *          @arg @ref HAL_PCD_DISCONNECT_CB_ID OTG PCD Disconnect callback ID
 *          @arg @ref HAL_PCD_MSPINIT_CB_ID MspDeInit callback ID
 *          @arg @ref HAL_PCD_MSPDEINIT_CB_ID MspDeInit callback ID
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterCallback(PCD_HandleTypeDef *hpcd, HAL_PCD_CallbackIDTypeDef CallbackID)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

	/* Setup Legacy weak Callbacks  */
	if (hpcd->State == HAL_PCD_STATE_READY) {
		switch (CallbackID) {
			case HAL_PCD_SOF_CB_ID:
				hpcd->SOFCallback = HAL_PCD_SOFCallback;
				break;

			case HAL_PCD_SETUPSTAGE_CB_ID:
				hpcd->SetupStageCallback = HAL_PCD_SetupStageCallback;
				break;

