4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
			case HAL_PCD_RESET_CB_ID:
				hpcd->ResetCallback = HAL_PCD_ResetCallback;
				break;

			case HAL_PCD_SUSPEND_CB_ID:
				hpcd->SuspendCallback = HAL_PCD_SuspendCallback;
				break;

			case HAL_PCD_RESUME_CB_ID:
				hpcd->ResumeCallback = HAL_PCD_ResumeCallback;
				break;

			case HAL_PCD_CONNECT_CB_ID:
				hpcd->ConnectCallback = HAL_PCD_ConnectCallback;
				break;

			case HAL_PCD_DISCONNECT_CB_ID:
				hpcd->DisconnectCallback = HAL_PCD_DisconnectCallback;
				break;

			case HAL_PCD_MSPINIT_CB_ID:
				hpcd->MspInitCallback = HAL_PCD_MspInit;
				break;

			case HAL_PCD_MSPDEINIT_CB_ID:
				hpcd->MspDeInitCallback = HAL_PCD_MspDeInit;
				break;

			default:
				/* Update the error code */
				hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

				/* Return error status */
				status = HAL_ERROR;
				break;
		}
	} else if (hpcd->State == HAL_PCD_STATE_RESET) {
		switch (CallbackID) {
			case HAL_PCD_MSPINIT_CB_ID:
				hpcd->MspInitCallback = HAL_PCD_MspInit;
				break;

			case HAL_PCD_MSPDEINIT_CB_ID:
				hpcd->MspDeInitCallback = HAL_PCD_MspDeInit;
				break;

			default:
				/* Update the error code */
				hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

				/* Return error status */
				status = HAL_ERROR;
				break;
		}
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);
	return status;
}

/**
 * @brief  Register USB PCD Data OUT Stage Callback
 *         To be used instead of the weak HAL_PCD_DataOutStageCallback() predefined callback
 * @param  hpcd PCD handle
 * @param  pCallback pointer to the USB PCD Data OUT Stage Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_RegisterDataOutStageCallback(PCD_HandleTypeDef *hpcd,
													   pPCD_DataOutStageCallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		return HAL_ERROR;
	}

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->DataOutStageCallback = pCallback;
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Unregister the USB PCD Data OUT Stage Callback
 *         USB PCD Data OUT Stage Callback is redirected to the weak HAL_PCD_DataOutStageCallback() predefined callback
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterDataOutStageCallback(PCD_HandleTypeDef *hpcd)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->DataOutStageCallback = HAL_PCD_DataOutStageCallback; /* Legacy weak DataOutStageCallback  */
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Register USB PCD Data IN Stage Callback
 *         To be used instead of the weak HAL_PCD_DataInStageCallback() predefined callback
 * @param  hpcd PCD handle
 * @param  pCallback pointer to the USB PCD Data IN Stage Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_RegisterDataInStageCallback(PCD_HandleTypeDef *hpcd,
													  pPCD_DataInStageCallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		return HAL_ERROR;
	}

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->DataInStageCallback = pCallback;
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Unregister the USB PCD Data IN Stage Callback
 *         USB PCD Data OUT Stage Callback is redirected to the weak HAL_PCD_DataInStageCallback() predefined callback
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterDataInStageCallback(PCD_HandleTypeDef *hpcd)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->DataInStageCallback = HAL_PCD_DataInStageCallback; /* Legacy weak DataInStageCallback  */
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Register USB PCD Iso OUT incomplete Callback
 *         To be used instead of the weak HAL_PCD_ISOOUTIncompleteCallback() predefined callback
 * @param  hpcd PCD handle
 * @param  pCallback pointer to the USB PCD Iso OUT incomplete Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_RegisterIsoOutIncpltCallback(PCD_HandleTypeDef *hpcd,
													   pPCD_IsoOutIncpltCallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		return HAL_ERROR;
	}

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->ISOOUTIncompleteCallback = pCallback;
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Unregister the USB PCD Iso OUT incomplete Callback
 *         USB PCD Iso OUT incomplete Callback is redirected
 *         to the weak HAL_PCD_ISOOUTIncompleteCallback() predefined callback
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterIsoOutIncpltCallback(PCD_HandleTypeDef *hpcd)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

