4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->ISOOUTIncompleteCallback = HAL_PCD_ISOOUTIncompleteCallback; /* Legacy weak ISOOUTIncompleteCallback  */
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Register USB PCD Iso IN incomplete Callback
 *         To be used instead of the weak HAL_PCD_ISOINIncompleteCallback() predefined callback
 * @param  hpcd PCD handle
 * @param  pCallback pointer to the USB PCD Iso IN incomplete Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_RegisterIsoInIncpltCallback(PCD_HandleTypeDef *hpcd,
													  pPCD_IsoInIncpltCallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		return HAL_ERROR;
	}

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->ISOINIncompleteCallback = pCallback;
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Unregister the USB PCD Iso IN incomplete Callback
 *         USB PCD Iso IN incomplete Callback is redirected
 *         to the weak HAL_PCD_ISOINIncompleteCallback() predefined callback
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterIsoInIncpltCallback(PCD_HandleTypeDef *hpcd)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->ISOINIncompleteCallback = HAL_PCD_ISOINIncompleteCallback; /* Legacy weak ISOINIncompleteCallback  */
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Register USB PCD BCD Callback
 *         To be used instead of the weak HAL_PCDEx_BCD_Callback() predefined callback
 * @param  hpcd PCD handle
 * @param  pCallback pointer to the USB PCD BCD Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_RegisterBcdCallback(PCD_HandleTypeDef *hpcd, pPCD_BcdCallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		return HAL_ERROR;
	}

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->BCDCallback = pCallback;
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Unregister the USB PCD BCD Callback
 *         USB BCD Callback is redirected to the weak HAL_PCDEx_BCD_Callback() predefined callback
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterBcdCallback(PCD_HandleTypeDef *hpcd)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->BCDCallback = HAL_PCDEx_BCD_Callback; /* Legacy weak HAL_PCDEx_BCD_Callback  */
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Register USB PCD LPM Callback
 *         To be used instead of the weak HAL_PCDEx_LPM_Callback() predefined callback
 * @param  hpcd PCD handle
 * @param  pCallback pointer to the USB PCD LPM Callback function
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_RegisterLpmCallback(PCD_HandleTypeDef *hpcd, pPCD_LpmCallbackTypeDef pCallback)
{
	HAL_StatusTypeDef status = HAL_OK;

	if (pCallback == NULL) {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		return HAL_ERROR;
	}

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->LPMCallback = pCallback;
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}

/**
 * @brief  Unregister the USB PCD LPM Callback
 *         USB LPM Callback is redirected to the weak HAL_PCDEx_LPM_Callback() predefined callback
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_UnRegisterLpmCallback(PCD_HandleTypeDef *hpcd)
{
	HAL_StatusTypeDef status = HAL_OK;

	/* Process locked */
	__HAL_LOCK(hpcd);

	if (hpcd->State == HAL_PCD_STATE_READY) {
		hpcd->LPMCallback = HAL_PCDEx_LPM_Callback; /* Legacy weak HAL_PCDEx_LPM_Callback  */
	} else {
		/* Update the error code */
		hpcd->ErrorCode |= HAL_PCD_ERROR_INVALID_CALLBACK;

		/* Return error status */
		status = HAL_ERROR;
	}

	/* Release Lock */
	__HAL_UNLOCK(hpcd);

	return status;
}
		#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

/**
 * @}
 */

/** @defgroup PCD_Exported_Functions_Group2 Input and Output operation functions
  *  @brief   Data transfers functions
  *
@verbatim
 ===============================================================================
					  ##### IO operation functions #####
 ===============================================================================
	[..]
	This subsection provides a set of functions allowing to manage the PCD data
	transfers.

@endverbatim
  * @{
  */

/**
 * @brief  Start the USB device
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_Start(PCD_HandleTypeDef *hpcd)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;

	__HAL_LOCK(hpcd);

	if ((hpcd->Init.battery_charging_enable == 1U) && (hpcd->Init.phy_itface != USB_OTG_ULPI_PHY)) {
		/* Enable USB Transceiver */
		USBx->GCCFG |= USB_OTG_GCCFG_PWRDWN;
	}

	__HAL_PCD_ENABLE(hpcd);
	(void)USB_DevConnect(hpcd->Instance);
	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

/**
 * @brief  Stop the USB device.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_Stop(PCD_HandleTypeDef *hpcd)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;

	__HAL_LOCK(hpcd);
	__HAL_PCD_DISABLE(hpcd);
	(void)USB_DevDisconnect(hpcd->Instance);

	(void)USB_FlushTxFifo(hpcd->Instance, 0x10U);

	if ((hpcd->Init.battery_charging_enable == 1U) && (hpcd->Init.phy_itface != USB_OTG_ULPI_PHY)) {
		/* Disable USB Transceiver */
		USBx->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);
	}

	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

