4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
			for (i = 0U; i < hpcd->Init.dev_endpoints; i++) {
				USBx_INEP(i)->DIEPINT = 0xFB7FU;
				USBx_INEP(i)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
				USBx_OUTEP(i)->DOEPINT = 0xFB7FU;
				USBx_OUTEP(i)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
				USBx_OUTEP(i)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
			}
			USBx_DEVICE->DAINTMSK |= 0x10001U;

			if (hpcd->Init.use_dedicated_ep1 != 0U) {
				USBx_DEVICE->DOUTEP1MSK |= USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM | USB_OTG_DOEPMSK_EPDM;

				USBx_DEVICE->DINEP1MSK |= USB_OTG_DIEPMSK_TOM | USB_OTG_DIEPMSK_XFRCM | USB_OTG_DIEPMSK_EPDM;
			} else {
				USBx_DEVICE->DOEPMSK |= USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM | USB_OTG_DOEPMSK_EPDM |
										USB_OTG_DOEPMSK_OTEPSPRM | USB_OTG_DOEPMSK_NAKM;

				USBx_DEVICE->DIEPMSK |= USB_OTG_DIEPMSK_TOM | USB_OTG_DIEPMSK_XFRCM | USB_OTG_DIEPMSK_EPDM;
			}

			/* Set Default Address to 0 */
			USBx_DEVICE->DCFG &= ~USB_OTG_DCFG_DAD;

			/* setup EP0 to receive SETUP packets */
			(void)USB_EP0_OutStart(hpcd->Instance, (uint8_t)hpcd->Init.dma_enable, (uint8_t *)hpcd->Setup);

			__HAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GINTSTS_USBRST);
		}

		/* Handle Enumeration done Interrupt */
		if (__HAL_PCD_GET_FLAG(hpcd, USB_OTG_GINTSTS_ENUMDNE)) {
			(void)USB_ActivateSetup(hpcd->Instance);
			hpcd->Init.speed = USB_GetDevSpeed(hpcd->Instance);

			/* Set USB Turnaround time */
			(void)USB_SetTurnaroundTime(hpcd->Instance, HAL_RCC_GetHCLK1Freq(), (uint8_t)hpcd->Init.speed);

			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
			hpcd->ResetCallback(hpcd);
			#else
			HAL_PCD_ResetCallback(hpcd);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

			__HAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GINTSTS_ENUMDNE);
		}

		/* Handle SOF Interrupt */
		if (__HAL_PCD_GET_FLAG(hpcd, USB_OTG_GINTSTS_SOF)) {
			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
			hpcd->SOFCallback(hpcd);
			#else
			HAL_PCD_SOFCallback(hpcd);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

			__HAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GINTSTS_SOF);
		}

		/* Handle Incomplete ISO IN Interrupt */
		if (__HAL_PCD_GET_FLAG(hpcd, USB_OTG_GINTSTS_IISOIXFR)) {
			/* Keep application checking the corresponding Iso IN endpoint
			causing the incomplete Interrupt */
			epnum = 0U;

			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
			hpcd->ISOINIncompleteCallback(hpcd, (uint8_t)epnum);
			#else
			HAL_PCD_ISOINIncompleteCallback(hpcd, (uint8_t)epnum);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

			__HAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GINTSTS_IISOIXFR);
		}

		/* Handle Incomplete ISO OUT Interrupt */
		if (__HAL_PCD_GET_FLAG(hpcd, USB_OTG_GINTSTS_PXFR_INCOMPISOOUT)) {
			/* Keep application checking the corresponding Iso OUT endpoint
			causing the incomplete Interrupt */
			epnum = 0U;

			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
			hpcd->ISOOUTIncompleteCallback(hpcd, (uint8_t)epnum);
			#else
			HAL_PCD_ISOOUTIncompleteCallback(hpcd, (uint8_t)epnum);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

			__HAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GINTSTS_PXFR_INCOMPISOOUT);
		}

		/* Handle Connection event Interrupt */
		if (__HAL_PCD_GET_FLAG(hpcd, USB_OTG_GINTSTS_SRQINT)) {
			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
			hpcd->ConnectCallback(hpcd);
			#else
			HAL_PCD_ConnectCallback(hpcd);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

			__HAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GINTSTS_SRQINT);
		}

		/* Handle Disconnection event Interrupt */
		if (__HAL_PCD_GET_FLAG(hpcd, USB_OTG_GINTSTS_OTGINT)) {
			temp = hpcd->Instance->GOTGINT;

			if ((temp & USB_OTG_GOTGINT_SEDET) == USB_OTG_GOTGINT_SEDET) {
			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
				hpcd->DisconnectCallback(hpcd);
			#else
				HAL_PCD_DisconnectCallback(hpcd);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
			}
			hpcd->Instance->GOTGINT |= temp;
		}
	}
}
		#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */

/**
 * @brief  Data OUT stage callback.
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);
	UNUSED(epnum);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_DataOutStageCallback could be implemented in the user file
	 */
}

/**
 * @brief  Data IN stage callback
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);
	UNUSED(epnum);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_DataInStageCallback could be implemented in the user file
	 */
}
/**
 * @brief  Setup stage callback
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_SetupStageCallback could be implemented in the user file
	 */
}

/**
 * @brief  USB Start Of Frame callback.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_SOFCallback could be implemented in the user file
	 */
}

/**
 * @brief  USB Reset callback.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_ResetCallback could be implemented in the user file
	 */
}

/**
 * @brief  Suspend event callback.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_SuspendCallback could be implemented in the user file
	 */
}

/**
 * @brief  Resume event callback.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_ResumeCallback could be implemented in the user file
	 */
}

/**
 * @brief  Incomplete ISO OUT callback.
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);
	UNUSED(epnum);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
	 */
}

/**
 * @brief  Incomplete ISO IN callback.
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval None
 */
__weak void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);
	UNUSED(epnum);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_ISOINIncompleteCallback could be implemented in the user file
	 */
}

/**
 * @brief  Connection event callback.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_ConnectCallback could be implemented in the user file
	 */
}

/**
 * @brief  Disconnection event callback.
 * @param  hpcd PCD handle
 * @retval None
 */
__weak void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(hpcd);

	/* NOTE : This function should not be modified, when the callback is needed,
			  the HAL_PCD_DisconnectCallback could be implemented in the user file
	 */
}

/**
 * @}
 */

