4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
/** @defgroup PCD_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   management functions
  *
@verbatim
 ===============================================================================
					  ##### Peripheral Control functions #####
 ===============================================================================
	[..]
	This subsection provides a set of functions allowing to control the PCD data
	transfers.

@endverbatim
  * @{
  */

/**
 * @brief  Connect the USB device
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DevConnect(PCD_HandleTypeDef *hpcd)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;

	__HAL_LOCK(hpcd);

	if ((hpcd->Init.battery_charging_enable == 1U) && (hpcd->Init.phy_itface != USB_OTG_ULPI_PHY)) {
		/* Enable USB Transceiver */
		USBx->GCCFG |= USB_OTG_GCCFG_PWRDWN;
	}
	(void)USB_DevConnect(hpcd->Instance);
	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

/**
 * @brief  Disconnect the USB device.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DevDisconnect(PCD_HandleTypeDef *hpcd)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;

	__HAL_LOCK(hpcd);
	(void)USB_DevDisconnect(hpcd->Instance);

	if ((hpcd->Init.battery_charging_enable == 1U) && (hpcd->Init.phy_itface != USB_OTG_ULPI_PHY)) {
		/* Disable USB Transceiver */
		USBx->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);
	}

	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

/**
 * @brief  Set the USB Device address.
 * @param  hpcd PCD handle
 * @param  address new device address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_SetAddress(PCD_HandleTypeDef *hpcd, uint8_t address)
{
	__HAL_LOCK(hpcd);
	hpcd->USB_Address = address;
	(void)USB_SetDevAddress(hpcd->Instance, address);
	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}
/**
 * @brief  Open and configure an endpoint.
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @param  ep_mps endpoint max packet size
 * @param  ep_type endpoint type
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Open(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint16_t ep_mps, uint8_t ep_type)
{
	HAL_StatusTypeDef ret = HAL_OK;
	PCD_EPTypeDef *ep;

	if ((ep_addr & 0x80U) == 0x80U) {
		ep = &hpcd->IN_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 1U;
	} else {
		ep = &hpcd->OUT_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 0U;
	}

	ep->num = ep_addr & EP_ADDR_MSK;
	ep->maxpacket = ep_mps;
	ep->type = ep_type;

	if (ep->is_in != 0U) {
		/* Assign a Tx FIFO */
		ep->tx_fifo_num = ep->num;
	}
	/* Set initial data PID. */
	if (ep_type == EP_TYPE_BULK) {
		ep->data_pid_start = 0U;
	}

	__HAL_LOCK(hpcd);
	(void)USB_ActivateEndpoint(hpcd->Instance, ep);
	__HAL_UNLOCK(hpcd);

	return ret;
}

/**
 * @brief  Deactivate an endpoint.
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Close(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
	PCD_EPTypeDef *ep;

	if ((ep_addr & 0x80U) == 0x80U) {
		ep = &hpcd->IN_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 1U;
	} else {
		ep = &hpcd->OUT_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 0U;
	}
	ep->num = ep_addr & EP_ADDR_MSK;

	__HAL_LOCK(hpcd);
	(void)USB_DeactivateEndpoint(hpcd->Instance, ep);
	__HAL_UNLOCK(hpcd);
	return HAL_OK;
}

/**
 * @brief  Receive an amount of data.
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @param  pBuf pointer to the reception buffer
 * @param  len amount of data to be received
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Receive(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
	PCD_EPTypeDef *ep;

	ep = &hpcd->OUT_ep[ep_addr & EP_ADDR_MSK];

	/*setup and start the Xfer */
	ep->xfer_buff = pBuf;
	ep->xfer_len = len;
	ep->xfer_count = 0U;
	ep->is_in = 0U;
	ep->num = ep_addr & EP_ADDR_MSK;

	if (hpcd->Init.dma_enable == 1U) {
		ep->dma_addr = (uint32_t)pBuf;
	}

	if ((ep_addr & EP_ADDR_MSK) == 0U) {
		(void)USB_EP0StartXfer(hpcd->Instance, ep, (uint8_t)hpcd->Init.dma_enable);
	} else {
		(void)USB_EPStartXfer(hpcd->Instance, ep, (uint8_t)hpcd->Init.dma_enable);
	}

	return HAL_OK;
}

/**
 * @brief  Get Received Data Size
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval Data Size
 */
uint32_t HAL_PCD_EP_GetRxCount(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
	return hpcd->OUT_ep[ep_addr & EP_ADDR_MSK].xfer_count;
}
/**
 * @brief  Send an amount of data
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @param  pBuf pointer to the transmission buffer
 * @param  len amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Transmit(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len)
{
	PCD_EPTypeDef *ep;

	ep = &hpcd->IN_ep[ep_addr & EP_ADDR_MSK];

	/*setup and start the Xfer */
	ep->xfer_buff = pBuf;
	ep->xfer_len = len;
	ep->xfer_count = 0U;
	ep->is_in = 1U;
	ep->num = ep_addr & EP_ADDR_MSK;

	if (hpcd->Init.dma_enable == 1U) {
		ep->dma_addr = (uint32_t)pBuf;
	}

	if ((ep_addr & EP_ADDR_MSK) == 0U) {
		(void)USB_EP0StartXfer(hpcd->Instance, ep, (uint8_t)hpcd->Init.dma_enable);
	} else {
		(void)USB_EPStartXfer(hpcd->Instance, ep, (uint8_t)hpcd->Init.dma_enable);
	}

	return HAL_OK;
}

/**
 * @brief  Set a STALL condition over an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_SetStall(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
	PCD_EPTypeDef *ep;

	if (((uint32_t)ep_addr & EP_ADDR_MSK) > hpcd->Init.dev_endpoints) {
		return HAL_ERROR;
	}

	if ((0x80U & ep_addr) == 0x80U) {
		ep = &hpcd->IN_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 1U;
	} else {
		ep = &hpcd->OUT_ep[ep_addr];
		ep->is_in = 0U;
	}

	ep->is_stall = 1U;
	ep->num = ep_addr & EP_ADDR_MSK;

	__HAL_LOCK(hpcd);

	(void)USB_EPSetStall(hpcd->Instance, ep);

	if ((ep_addr & EP_ADDR_MSK) == 0U) {
		(void)USB_EP0_OutStart(hpcd->Instance, (uint8_t)hpcd->Init.dma_enable, (uint8_t *)hpcd->Setup);
	}

	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

/**
 * @brief  Clear a STALL condition over in an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_ClrStall(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
	PCD_EPTypeDef *ep;

	if (((uint32_t)ep_addr & 0x0FU) > hpcd->Init.dev_endpoints) {
		return HAL_ERROR;
	}

	if ((0x80U & ep_addr) == 0x80U) {
		ep = &hpcd->IN_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 1U;
	} else {
		ep = &hpcd->OUT_ep[ep_addr & EP_ADDR_MSK];
		ep->is_in = 0U;
	}

	ep->is_stall = 0U;
	ep->num = ep_addr & EP_ADDR_MSK;

	__HAL_LOCK(hpcd);
	(void)USB_EPClearStall(hpcd->Instance, ep);
	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

/**
 * @brief  Abort an USB EP transaction.
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Abort(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
	HAL_StatusTypeDef ret;
	PCD_EPTypeDef *ep;

	if ((0x80U & ep_addr) == 0x80U) {
		ep = &hpcd->IN_ep[ep_addr & EP_ADDR_MSK];
	} else {
		ep = &hpcd->OUT_ep[ep_addr & EP_ADDR_MSK];
	}

	/* Stop Xfer */
	ret = USB_EPStopXfer(hpcd->Instance, ep);

	return ret;
}

/**
 * @brief  Flush an endpoint
 * @param  hpcd PCD handle
 * @param  ep_addr endpoint address
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_EP_Flush(PCD_HandleTypeDef *hpcd, uint8_t ep_addr)
{
	__HAL_LOCK(hpcd);

	if ((ep_addr & 0x80U) == 0x80U) {
		(void)USB_FlushTxFifo(hpcd->Instance, (uint32_t)ep_addr & EP_ADDR_MSK);
	} else {
		(void)USB_FlushRxFifo(hpcd->Instance);
	}

	__HAL_UNLOCK(hpcd);

	return HAL_OK;
}

/**
 * @brief  Activate remote wakeup signalling
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_ActivateRemoteWakeup(PCD_HandleTypeDef *hpcd)
{
	return (USB_ActivateRemoteWakeup(hpcd->Instance));
}

/**
 * @brief  De-activate remote wakeup signalling.
 * @param  hpcd PCD handle
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_DeActivateRemoteWakeup(PCD_HandleTypeDef *hpcd)
{
	return (USB_DeActivateRemoteWakeup(hpcd->Instance));
}

/**
 * @}
 */

