4ms/stm32mp1-baremetal/examples/shared/stm32hal_patched/stm32mp1xx_hal_pcd.c
/** @defgroup PCD_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions
  *
@verbatim
 ===============================================================================
					  ##### Peripheral State functions #####
 ===============================================================================
	[..]
	This subsection permits to get in run-time the status of the peripheral
	and the data flow.

@endverbatim
  * @{
  */

/**
 * @brief  Return the PCD handle state.
 * @param  hpcd PCD handle
 * @retval HAL state
 */
PCD_StateTypeDef HAL_PCD_GetState(PCD_HandleTypeDef *hpcd) { return hpcd->State; }

/**
 * @brief  Set the USB Device high speed test mode.
 * @param  hpcd PCD handle
 * @param  address test mode
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_PCD_SetTestMode(PCD_HandleTypeDef *hpcd, uint8_t testmode)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;
	uint32_t USBx_BASE = (uint32_t)USBx;

	switch (testmode) {
		case TEST_J:
		case TEST_K:
		case TEST_SE0_NAK:
		case TEST_PACKET:
		case TEST_FORCE_EN:
			USBx_DEVICE->DCTL |= testmode << 4;
			break;

		default:
			break;
	}

	return HAL_OK;
}
		/**
		 * @}
		 */

		/**
		 * @}
		 */

		/* Private functions ---------------------------------------------------------*/
		/** @addtogroup PCD_Private_Functions
		 * @{
		 */
		#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
/**
 * @brief  Check FIFO for the next packet to be loaded.
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval HAL status
 */
static HAL_StatusTypeDef PCD_WriteEmptyTxFifo(PCD_HandleTypeDef *hpcd, uint32_t epnum)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;
	uint32_t USBx_BASE = (uint32_t)USBx;
	USB_OTG_EPTypeDef *ep;
	uint32_t len;
	uint32_t len32b;
	uint32_t fifoemptymsk;

	ep = &hpcd->IN_ep[epnum];

	if (ep->xfer_count > ep->xfer_len) {
		return HAL_ERROR;
	}

	len = ep->xfer_len - ep->xfer_count;

	if (len > ep->maxpacket) {
		len = ep->maxpacket;
	}

	len32b = (len + 3U) / 4U;

	while (((USBx_INEP(epnum)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV) >= len32b) && (ep->xfer_count < ep->xfer_len) &&
		   (ep->xfer_len != 0U))
	{
		/* Write the FIFO */
		len = ep->xfer_len - ep->xfer_count;

		if (len > ep->maxpacket) {
			len = ep->maxpacket;
		}
		len32b = (len + 3U) / 4U;

		(void)USB_WritePacket(USBx, ep->xfer_buff, (uint8_t)epnum, (uint16_t)len, (uint8_t)hpcd->Init.dma_enable);

		ep->xfer_buff += len;
		ep->xfer_count += len;
	}

	if (ep->xfer_len <= ep->xfer_count) {
		fifoemptymsk = (uint32_t)(0x1UL << (epnum & EP_ADDR_MSK));
		USBx_DEVICE->DIEPEMPMSK &= ~fifoemptymsk;
	}

	return HAL_OK;
}

/**
 * @brief  process EP OUT transfer complete interrupt.
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval HAL status
 */
static HAL_StatusTypeDef PCD_EP_OutXfrComplete_int(PCD_HandleTypeDef *hpcd, uint32_t epnum)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t gSNPSiD = *(__IO uint32_t *)(&USBx->CID + 0x1U);
	uint32_t DoepintReg = USBx_OUTEP(epnum)->DOEPINT;

	if (hpcd->Init.dma_enable == 1U) {
		if ((DoepintReg & USB_OTG_DOEPINT_STUP) == USB_OTG_DOEPINT_STUP) /* Class C */ {
			/* StupPktRcvd = 1 this is a setup packet */
			if ((gSNPSiD > USB_OTG_CORE_ID_300A) && ((DoepintReg & USB_OTG_DOEPINT_STPKTRX) == USB_OTG_DOEPINT_STPKTRX))
			{
				CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_STPKTRX);
			}
		} else if ((DoepintReg & USB_OTG_DOEPINT_OTEPSPR) == USB_OTG_DOEPINT_OTEPSPR) /* Class E */ {
			CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_OTEPSPR);
		} else if ((DoepintReg & (USB_OTG_DOEPINT_STUP | USB_OTG_DOEPINT_OTEPSPR)) == 0U) {
			/* StupPktRcvd = 1 this is a setup packet */
			if ((gSNPSiD > USB_OTG_CORE_ID_300A) && ((DoepintReg & USB_OTG_DOEPINT_STPKTRX) == USB_OTG_DOEPINT_STPKTRX))
			{
				CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_STPKTRX);
			} else {
				/* out data packet received over EP0 */
				hpcd->OUT_ep[epnum].xfer_count =
					hpcd->OUT_ep[epnum].maxpacket - (USBx_OUTEP(epnum)->DOEPTSIZ & USB_OTG_DOEPTSIZ_XFRSIZ);

				hpcd->OUT_ep[epnum].xfer_buff += hpcd->OUT_ep[epnum].maxpacket;

				if ((epnum == 0U) && (hpcd->OUT_ep[epnum].xfer_len == 0U)) {
					/* this is ZLP, so prepare EP0 for next setup */
					(void)USB_EP0_OutStart(hpcd->Instance, 1U, (uint8_t *)hpcd->Setup);
				}
			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
				hpcd->DataOutStageCallback(hpcd, (uint8_t)epnum);
			#else
				HAL_PCD_DataOutStageCallback(hpcd, (uint8_t)epnum);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
			}
		} else {
			/* ... */
		}
	} else {
		if (gSNPSiD == USB_OTG_CORE_ID_310A) {
			/* StupPktRcvd = 1 this is a setup packet */
			if ((DoepintReg & USB_OTG_DOEPINT_STPKTRX) == USB_OTG_DOEPINT_STPKTRX) {
				CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_STPKTRX);
			} else {
				if ((DoepintReg & USB_OTG_DOEPINT_OTEPSPR) == USB_OTG_DOEPINT_OTEPSPR) {
					CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_OTEPSPR);
				}

			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
				hpcd->DataOutStageCallback(hpcd, (uint8_t)epnum);
			#else
				HAL_PCD_DataOutStageCallback(hpcd, (uint8_t)epnum);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
			}
		} else {
			if ((epnum == 0U) && (hpcd->OUT_ep[epnum].xfer_len == 0U)) {
				/* this is ZLP, so prepare EP0 for next setup */
				(void)USB_EP0_OutStart(hpcd->Instance, 0U, (uint8_t *)hpcd->Setup);
			}

			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
			hpcd->DataOutStageCallback(hpcd, (uint8_t)epnum);
			#else
			HAL_PCD_DataOutStageCallback(hpcd, (uint8_t)epnum);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
		}
	}

	return HAL_OK;
}

/**
 * @brief  process EP OUT setup packet received interrupt.
 * @param  hpcd PCD handle
 * @param  epnum endpoint number
 * @retval HAL status
 */
static HAL_StatusTypeDef PCD_EP_OutSetupPacket_int(PCD_HandleTypeDef *hpcd, uint32_t epnum)
{
	USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;
	uint32_t USBx_BASE = (uint32_t)USBx;
	uint32_t gSNPSiD = *(__IO uint32_t *)(&USBx->CID + 0x1U);
	uint32_t DoepintReg = USBx_OUTEP(epnum)->DOEPINT;

	if ((gSNPSiD > USB_OTG_CORE_ID_300A) && ((DoepintReg & USB_OTG_DOEPINT_STPKTRX) == USB_OTG_DOEPINT_STPKTRX)) {
		CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_STPKTRX);
	}

			/* Inform the upper layer that a setup packet is available */
			#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
	hpcd->SetupStageCallback(hpcd);
			#else
	HAL_PCD_SetupStageCallback(hpcd);
			#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

	if ((gSNPSiD > USB_OTG_CORE_ID_300A) && (hpcd->Init.dma_enable == 1U)) {
		(void)USB_EP0_OutStart(hpcd->Instance, 1U, (uint8_t *)hpcd->Setup);
	}

	return HAL_OK;
}
		#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */

	/**
	 * @}
	 */
	#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */
#endif	   /* HAL_PCD_MODULE_ENABLED */

/**
 * @}
 */

/**
 * @}
 */
